<template>
  <v-overlay class="flex items-center justify-center">
    <div
      class="p-8 bg-[--black-middle] flex-col relative rounded-md max-w-[700px]"
    >
      <div class="absolute right-5 top-5">
        <v-btn
          theme="dark"
          density="compact"
          icon="mdi-plus"
          class="rotate-45 z-10"
          color="#E02A23"
          @click="clickOnButton"
        ></v-btn>
      </div>
      <div class="flex flex-col items-start gap-[15px]">
        <div class="font-medium text-[20px] text">Обычный текстовый попап</div>
        <div class="overflow-auto max-h-[470px] pr-6">
          <p clas="font-medium text-[--grey]">
            Гироскопический прибор устойчив. Параметр Родинга-Гамильтона
            позволяет исключить из рассмотрения уходящий центр подвеса,
            основываясь на ограничениях, наложенных на систему. Ротор требует
            большего внимания к анализу ошибок, которые даёт колебательный
            момент. Под воздействием изменяемого вектора гравитации
            прецессионная теория гироскопов колебательно вращает газообразный
            уход гироскопа. Гироскопический прибор устойчив. Параметр
            Родинга-Гамильтона позволяет исключить из рассмотрения уходящий
            центр подвеса, основываясь на ограничениях, наложенных на систему.
            Ротор требует большего внимания к анализу ошибок, которые даёт
            колебательный момент. Под воздействием изменяемого вектора
            гравитации прецессионная теория гироскопов колебательно вращает
            газообразный уход гироскопа. Гироскопический прибор устойчив.
            Параметр Родинга-Гамильтона позволяет исключить из рассмотрения
            уходящий центр подвеса, основываясь на ограничениях, наложенных на
            систему. Ротор требует большего внимания к анализу ошибок, которые
            даёт колебательный момент. Под воздействием изменяемого вектора
            гравитации прецессионная теория гироскопов колебательно вращает
            газообразный уход гироскопа. Гироскопический прибор устойчив.
            Параметр Родинга-Гамильтона позволяет исключить из рассмотрения
            уходящий центр подвеса, основываясь на ограничениях, наложенных на
            систему. Ротор требует большего внимания к анализу ошибок, которые
            даёт колебательный момент. Под воздействием изменяемого вектора
            гравитации прецессионная теория гироскопов колебательно вращает
            газообразный уход гироскопа. Гироскопический прибор устойчив.
            Параметр Родинга-Гамильтона позволяет исключить из рассмотрения
            уходящий центр подвеса, основываясь на ограничениях, наложенных на
            систему. Ротор требует большего внимания к анализу ошибок, которые
            даёт колебательный момент. Под воздействием изменяемого вектора
            гравитации прецессионная теория гироскопов колебательно вращает
            газообразный уход гироскопа. Гироскопический прибор устойчив.
            Параметр Родинга-Гамильтона позволяет исключить из рассмотрения
            уходящий центр подвеса, основываясь на ограничениях, наложенных на
            систему. Ротор требует большего внимания к анализу ошибок, которые
            даёт колебательный момент. Под воздействием изменяемого вектора
            гравитации прецессионная теория гироскопов колебательно вращает
            газообразный уход гироскопа. Гироскопический прибор устойчив.
            Параметр Родинга-Гамильтона позволяет исключить из рассмотрения
            уходящий центр подвеса, основываясь на ограничениях, наложенных на
            систему. Ротор требует большего внимания к анализу ошибок, которые
            даёт колебательный момент. Под воздействием изменяемого вектора
            гравитации прецессионная теория гироскопов колебательно вращает
            газообразный уход гироскопа. Гироскопический прибор устойчив.
            Параметр Родинга-Гамильтона позволяет исключить из рассмотрения
            уходящий центр подвеса, основываясь на ограничениях, наложенных на
            систему. Ротор требует большего внимания к анализу ошибок, которые
            даёт колебательный момент. Под воздействием изменяемого вектора
            гравитации прецессионная теория гироскопов колебательно вращает
            газообразный уход гироскопа.
          </p>
        </div>
      </div>
    </div>
  </v-overlay>
</template>

<script setup>
const emit = defineEmits(["click"]);

const clickOnButton = () => {
  emit("click");
};
</script>
